In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv('DataSets/athlete_events.csv')

In [4]:
print(df.head())
print(df.info())
print(df.Year.unique())

   ID                      Name Sex   Age  Height  Weight            Team  \
0   1                 A Dijiang   M  24.0   180.0    80.0           China
1   2                  A Lamusi   M  23.0   170.0    60.0           China
2   3       Gunnar Nielsen Aaby   M  24.0     NaN     NaN         Denmark
3   4      Edgar Lindenau Aabye   M  34.0     NaN     NaN  Denmark/Sweden
4   5  Christine Jacoba Aaftink   F  21.0   185.0    82.0     Netherlands

   NOC        Games  Year  Season       City          Sport  \
0  CHN  1992 Summer  1992  Summer  Barcelona     Basketball
1  CHN  2012 Summer  2012  Summer     London           Judo
2  DEN  1920 Summer  1920  Summer  Antwerpen       Football
3  DEN  1900 Summer  1900  Summer      Paris     Tug-Of-War
4  NED  1988 Winter  1988  Winter    Calgary  Speed Skating

                              Event Medal
0       Basketball Men's Basketball   NaN
1      Judo Men's Extra-Lightweight   NaN
2           Football Men's Football   NaN
3       Tug-Of-War Men's Tug-Of-War  Gold
4  Speed Skating Women's 500 metres   NaN
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  object
 3   Age     261642 non-null  float64
 4   Height  210945 non-null  float64
 5   Weight  208241 non-null  float64
 6   Team    271116 non-null  object
 7   NOC     271116 non-null  object
 8   Games   271116 non-null  object
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  object
 11  City    271116 non-null  object
 12  Sport   271116 non-null  object
 13  Event   271116 non-null  object
 14  Medal   39783 non-null   object
dtypes: float64(3), int64(2), object(10)
memory usage: 31.0+ MB
None
[1992 2012 1920 1900 1988 1994 1932 2002 1952 1980 2000 1996 1912 1924
 2014 1948 1998 2006 2008 2016 2004 1960 1964 1984 1968 1972 1936 1956
 1928 1976 2010 1906 1904 1908 1896]

In [5]:
print(df.Medal.unique())
print(df.Sport.unique())

[nan 'Gold' 'Bronze' 'Silver']
['Basketball' 'Judo' 'Football' 'Tug-Of-War' 'Speed Skating'
 'Cross Country Skiing' 'Athletics' 'Ice Hockey' 'Swimming' 'Badminton'
 'Sailing' 'Biathlon' 'Gymnastics' 'Art Competitions' 'Alpine Skiing'
 'Handball' 'Weightlifting' 'Wrestling' 'Luge' 'Water Polo' 'Hockey'
 'Rowing' 'Bobsleigh' 'Fencing' 'Equestrianism' 'Shooting' 'Boxing'
 'Taekwondo' 'Cycling' 'Diving' 'Canoeing' 'Tennis' 'Modern Pentathlon'
 'Figure Skating' 'Golf' 'Softball' 'Archery' 'Volleyball'
 'Synchronized Swimming' 'Table Tennis' 'Nordic Combined' 'Baseball'
 'Rhythmic Gymnastics' 'Freestyle Skiing' 'Rugby Sevens' 'Trampolining'
 'Beach Volleyball' 'Triathlon' 'Ski Jumping' 'Curling' 'Snowboarding'
 'Rugby' 'Short Track Speed Skating' 'Skeleton' 'Lacrosse' 'Polo'
 'Cricket' 'Racquets' 'Motorboating' 'Military Ski Patrol' 'Croquet'
 'Jeu De Paume' 'Roque' 'Alpinism' 'Basque Pelota' 'Aeronautics']

In [6]:
print(df.loc[df['Sport'] == 'Basketball'])

            ID                                Name Sex   Age  Height  Weight  \
0            1                           A Dijiang   M  24.0   180.0    80.0
167         69                   Tamara Abalde Daz   F  19.0   185.0    72.0
250        124               Youssef Mohamed Abbas   M  31.0     NaN     NaN
264        136                    Alessandro Abbio   M  29.0   195.0    85.0
346        192  Ahmed El-Sayed Abdel Hamid Mobarak   M  25.0   189.0    85.0
...        ...                                 ...  ..   ...     ...     ...
270742  135401                  Eurelijus ukauskas   M  30.0   218.0   115.0
270743  135402                  Mindaugas ukauskas   M  20.0   201.0   100.0
270744  135402                  Mindaugas ukauskas   M  28.0   201.0   100.0
271026  135530                      Philip Zwiener   M  23.0   202.0    98.0
271110  135568              Olga Igorevna Zyuzkova   F  33.0   171.0    69.0

             Team  NOC        Games  Year  Season            City       Sport  \
0           China  CHN  1992 Summer  1992  Summer       Barcelona  Basketball
167         Spain  ESP  2008 Summer  2008  Summer         Beijing  Basketball
250         Egypt  EGY  1952 Summer  1952  Summer        Helsinki  Basketball
264         Italy  ITA  2000 Summer  2000  Summer          Sydney  Basketball
346         Egypt  EGY  1972 Summer  1972  Summer          Munich  Basketball
...           ...  ...          ...   ...     ...             ...         ...
270742  Lithuania  LTU  2004 Summer  2004  Summer          Athina  Basketball
270743  Lithuania  LTU  1996 Summer  1996  Summer         Atlanta  Basketball
270744  Lithuania  LTU  2004 Summer  2004  Summer          Athina  Basketball
271026    Germany  GER  2008 Summer  2008  Summer         Beijing  Basketball
271110    Belarus  BLR  2016 Summer  2016  Summer  Rio de Janeiro  Basketball

                                Event   Medal
0         Basketball Men's Basketball     NaN
167     Basketball Women's Basketball     NaN
250       Basketball Men's Basketball     NaN
264       Basketball Men's Basketball     NaN
346       Basketball Men's Basketball     NaN
...                               ...     ...
270742    Basketball Men's Basketball     NaN
270743    Basketball Men's Basketball  Bronze
270744    Basketball Men's Basketball     NaN
271026    Basketball Men's Basketball     NaN
271110  Basketball Women's Basketball     NaN

[4536 rows x 15 columns]

In [32]:
df_bb = (df.loc[(df.Year == 1996) & (df['Sport'] == 'Basketball')])

In [34]:
df_bb.shape

(284, 15)

In [36]:
df_bb = (df.loc[(df.Year == 1996) & (df['Sport'] == 'Basketball') & df.Medal.notna()])

In [37]:
df_bb.shape

(71, 15)

In [39]:
print(df_bb)

            ID                               Name Sex   Age  Height  Weight  \
1856      1020       Adriana Aparecida dos Santos   F  25.0   180.0    61.0
4457      2546  Alessandra dos Santos de Oliveira   F  22.0   200.0    85.0
11673     6366                 Jennifer Lynn Azzi   F  27.0   172.0    64.0
14657     7901               Charles Wade Barkley   M  33.0   198.0   114.0
20094    10589                      Miroslav Beri   M  23.0   198.0    92.0
...        ...                                ...  ..   ...     ...     ...
241803  121107                       Milenko Topi   M  27.0   205.0   105.0
247280  123811                      Rytis Vaivila   M  25.0   193.0    92.0
259881  130102     Jennifer Hazel "Jenny" Whittle   F  22.0   197.0    85.0
270740  135401                 Eurelijus ukauskas   M  22.0   218.0   115.0
270743  135402                 Mindaugas ukauskas   M  20.0   201.0   100.0

                         Team  NOC        Games  Year  Season     City  \
1856                   Brazil  BRA  1996 Summer  1996  Summer  Atlanta
4457                   Brazil  BRA  1996 Summer  1996  Summer  Atlanta
11673           United States  USA  1996 Summer  1996  Summer  Atlanta
14657           United States  USA  1996 Summer  1996  Summer  Atlanta
20094   Serbia and Montenegro  SCG  1996 Summer  1996  Summer  Atlanta
...                       ...  ...          ...   ...     ...      ...
241803  Serbia and Montenegro  SCG  1996 Summer  1996  Summer  Atlanta
247280              Lithuania  LTU  1996 Summer  1996  Summer  Atlanta
259881              Australia  AUS  1996 Summer  1996  Summer  Atlanta
270740              Lithuania  LTU  1996 Summer  1996  Summer  Atlanta
270743              Lithuania  LTU  1996 Summer  1996  Summer  Atlanta

             Sport                          Event   Medal
1856    Basketball  Basketball Women's Basketball  Silver
4457    Basketball  Basketball Women's Basketball  Silver
11673   Basketball  Basketball Women's Basketball    Gold
14657   Basketball    Basketball Men's Basketball    Gold
20094   Basketball    Basketball Men's Basketball  Silver
...            ...                            ...     ...
241803  Basketball    Basketball Men's Basketball  Silver
247280  Basketball    Basketball Men's Basketball  Bronze
259881  Basketball  Basketball Women's Basketball  Bronze
270740  Basketball    Basketball Men's Basketball  Bronze
270743  Basketball    Basketball Men's Basketball  Bronze

[71 rows x 15 columns]